import math

def area(r):
    '''
    Возвращает площадь круга по заданному радиусу.

    Параметры:
        r (float): радиус круга

    Возвращаемое значение:
        (float): площадь круга

    Пример вызова:
        area(5) # вернет 78.53981633974483
    '''
    return math.pi * r * r

def perimeter(r):
    '''
    Возвращает длину окружности по заданному радиусу.

    Параметры:
        r (float): радиус круга

    Возвращаемое значение:
        (float): длина окружности

    Пример вызова:
        perimeter(5) # вернет 31.41592653589793
    '''
    return 2 * math.pi * r