def area(a, b):
    '''
    Возвращает площадь прямоугольника по заданным сторонам.

    Параметры:
        a (float): первая сторона прямоугольника
        b (float): вторая сторона прямоугольника

    Возвращаемое значение:
        (float): площадь прямоугольника

    Пример вызова:
        area(4, 5) # вернет 20
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника по заданным сторонам.

    Параметры:
        a (float): первая сторона прямоугольника
        b (float): вторая сторона прямоугольника

    Возвращаемое значение:
        (float): периметр прямоугольника

    Пример вызова:
        perimeter(4, 5) # вернет 18
    '''
    return (a + b) * 2