def area(a):
    '''
    Возвращает площадь квадрата по заданной стороне.

    Параметры:
        a (float): сторона квадрата

    Возвращаемое значение:
        (float): площадь квадрата

    Пример вызова:
        area(5) # вернет 25
    '''
    return a * a

def perimeter(a):
    '''
    Возвращает периметр квадрата по заданной стороне.

    Параметры:
        a (float): сторона квадрата

    Возвращаемое значение:
        (float): периметр квадрата

    Пример вызова:
        perimeter(5) # вернет 20
    '''
    return 4 * a