def area(a, h):
    '''
    Возвращает площадь треугольника по стороне и проведенной к ней высоте.

    Параметры:
        a (float): сторона треугольника
        h (float): высота, проведенная к стороне a

    Возвращаемое значение:
        (float): площадь треугольника

    Пример вызова:
        area(4, 5) # вернет 10.0
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника по трем заданным сторонам.

    Параметры:
        a (float): первая сторона
        b (float): вторая сторона
        c (float): третья сторона

    Возвращаемое значение:
        (float): периметр треугольника

    Пример вызова:
        perimeter(3, 4, 5) # вернет 12
    '''
    return a + b + c